app/controllers/documents_controller.rb

SELECT `documents`.* FROM `documents` ORDER BY name asc
---
  def modal_index
    @documents = Document.all