app/controllers/estimates_controller.rb

  def index
    @estimates = Estimate.all
---
SELECT `estimates`.* FROM `estimates`

  def create
    @estimate = Estimate.new(estimate_params)

    if @estimate.save
---
INSERT INTO `estimates` (`title`, `client`, `amount`, `status`, `created_at`, `updated_at`) VALUES ('', '', NULL, '', '2025-06-22 08:26:28.967780', '2025-06-22 08:26:28.967780')

  def set_estimate
    @estimate = Estimate.find(params[:id])
---
SELECT `estimates`.* FROM `estimates` WHERE `estimates`.`id` = 1 LIMIT 1